In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\akank\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\akank\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\akank\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\akank\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\akank\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\akank\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
df = pd.read_csv("Travel.csv")

In [6]:
df

,CustomerID,ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,NumberOfPersonVisiting,NumberOfFollowups,ProductPitched,PreferredPropertyStar,MaritalStatus,NumberOfTrips,Passport,PitchSatisfactionScore,OwnCar,NumberOfChildrenVisiting,Designation,MonthlyIncome
0,200000,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3,3.0,Deluxe,3.0,Single,1.0,1,2,1,0.0,Manager,20993.0
1,200001,0,49.0,Company Invited,1,14.0,Salaried,Male,3,4.0,Deluxe,4.0,Divorced,2.0,0,3,1,2.0,Manager,20130.0
2,200002,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3,4.0,Basic,3.0,Single,7.0,1,3,0,0.0,Executive,17090.0
3,200003,0,33.0,Company Invited,1,9.0,Salaried,Female,2,3.0,Basic,3.0,Divorced,2.0,1,5,1,1.0,Executive,17909.0
4,200004,0,NaN,Self Enquiry,1,8.0,Small Business,Male,2,3.0,Basic,4.0,Divorced,1.0,0,5,1,0.0,Executive,18468.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4883,204883,1,49.0,Self Enquiry,3,9.0,Small Business,Male,3,5.0,Deluxe,4.0,Unmarried,2.0,1,1,1,1.0,Manager,26576.0
4884,204884,1,28.0,Company Invited,1,31.0,Salaried,Male,4,5.0,Basic,3.0,Single,3.0,1,3,1,2.0,Executive,21212.0
4885,204885,1,52.0,Self Enquiry,3,17.0,Salaried,Female,4,4.0,Standard,4.0,Married,7.0,0,1,1,3.0,Senior Manager,31820.0
4886,204886,1,19.0,Self Enquiry,3,16.0,Small Business,Male,3,4.0,Basic,3.0,Single,3.0,0,5,0,2.0,Executive,20289.0
4887,204887,1,36.0,Self Enquiry,1,14.0,Salaried,Male,4,4.0,Basic,4.0,Unmarried,3.0,1,3,1,2.0,Executive,24041.0

In [7]:
df.head()

,CustomerID,ProdTaken,Age,TypeofContact,CityTier,DurationOfPitch,Occupation,Gender,NumberOfPersonVisiting,NumberOfFollowups,ProductPitched,PreferredPropertyStar,MaritalStatus,NumberOfTrips,Passport,PitchSatisfactionScore,OwnCar,NumberOfChildrenVisiting,Designation,MonthlyIncome
0,200000,1,41.0,Self Enquiry,3,6.0,Salaried,Female,3,3.0,Deluxe,3.0,Single,1.0,1,2,1,0.0,Manager,20993.0
1,200001,0,49.0,Company Invited,1,14.0,Salaried,Male,3,4.0,Deluxe,4.0,Divorced,2.0,0,3,1,2.0,Manager,20130.0
2,200002,1,37.0,Self Enquiry,1,8.0,Free Lancer,Male,3,4.0,Basic,3.0,Single,7.0,1,3,0,0.0,Executive,17090.0
3,200003,0,33.0,Company Invited,1,9.0,Salaried,Female,2,3.0,Basic,3.0,Divorced,2.0,1,5,1,1.0,Executive,17909.0
4,200004,0,NaN,Self Enquiry,1,8.0,Small Business,Male,2,3.0,Basic,4.0,Divorced,1.0,0,5,1,0.0,Executive,18468.0

In [8]:
df.dtypes

CustomerID                    int64
ProdTaken                     int64
Age                         float64
TypeofContact                object
CityTier                      int64
DurationOfPitch             float64
Occupation                   object
Gender                       object
NumberOfPersonVisiting        int64
NumberOfFollowups           float64
ProductPitched               object
PreferredPropertyStar       float64
MaritalStatus                object
NumberOfTrips               float64
Passport                      int64
PitchSatisfactionScore        int64
OwnCar                        int64
NumberOfChildrenVisiting    float64
Designation                  object
MonthlyIncome               float64
dtype: object

In [9]:
df.ProdTaken

0       1
1       0
2       1
3       0
4       0
       ..
4883    1
4884    1
4885    1
4886    1
4887    1
Name: ProdTaken, Length: 4888, dtype: int64

In [10]:
df.shape

(4888, 20)

In [11]:
df.Age

0       41.0
1       49.0
2       37.0
3       33.0
4        NaN
        ...
4883    49.0
4884    28.0
4885    52.0
4886    19.0
4887    36.0
Name: Age, Length: 4888, dtype: float64

QUESTIONS

A. What is the distribution of customerages, and how does age relate to product purchase (ProdTaken)?

In [12]:
df.Age.describe()

count    4662.000000
mean       37.622265
std         9.316387
min        18.000000
25%        31.000000
50%        36.000000
75%        44.000000
max        61.000000
Name: Age, dtype: float64

In [13]:
pd.crosstab(df.ProdTaken,df.Age)

Age,18.0,19.0,20.0,21.0,22.0,23.0,24.0,25.0,26.0,27.0,...,52.0,53.0,54.0,55.0,56.0,57.0,58.0,59.0,60.0,61.0
ProdTaken,,,,,,,,,,,,,,,,,,,,,
0,6,11,13,18,31,33,38,54,69,108,...,54,58,59,57,46,24,20,32,28,9
1,8,21,25,23,15,13,18,20,37,30,...,14,8,2,7,12,5,11,12,1,0

In [14]:
d1=df['Age'].value_counts()

In [15]:
d1

Age
35.0    237
36.0    231
34.0    211
31.0    203
30.0    199
32.0    197
33.0    189
37.0    185
29.0    178
38.0    176
41.0    155
39.0    150
28.0    147
40.0    146
42.0    142
27.0    138
43.0    130
46.0    121
45.0    116
26.0    106
44.0    105
51.0     90
47.0     88
50.0     86
25.0     74
52.0     68
53.0     66
48.0     65
49.0     65
55.0     64
54.0     61
56.0     58
24.0     56
22.0     46
23.0     46
59.0     44
21.0     41
20.0     38
19.0     32
58.0     31
57.0     29
60.0     29
18.0     14
61.0      9
Name: count, dtype: int64

In [16]:
d1.sort_index()

Age
18.0     14
19.0     32
20.0     38
21.0     41
22.0     46
23.0     46
24.0     56
25.0     74
26.0    106
27.0    138
28.0    147
29.0    178
30.0    199
31.0    203
32.0    197
33.0    189
34.0    211
35.0    237
36.0    231
37.0    185
38.0    176
39.0    150
40.0    146
41.0    155
42.0    142
43.0    130
44.0    105
45.0    116
46.0    121
47.0     88
48.0     65
49.0     65
50.0     86
51.0     90
52.0     68
53.0     66
54.0     61
55.0     64
56.0     58
57.0     29
58.0     31
59.0     44
60.0     29
61.0      9
Name: count, dtype: int64

In [17]:
df2=pd.pivot_table(df,values="ProdTaken" ,index='Age',aggfunc=np.sum)

In [18]:
df2

      ProdTaken
Age
18.0          8
19.0         21
20.0         25
21.0         23
22.0         15
23.0         13
24.0         18
25.0         20
26.0         37
27.0         30
28.0         26
29.0         57
30.0         48
31.0         41
32.0         40
33.0         40
34.0         44
35.0         34
36.0         27
37.0         24
38.0         15
39.0         14
40.0         23
41.0         24
42.0         20
43.0         10
44.0         17
45.0         18
46.0         11
47.0         12
48.0         11
49.0          9
50.0         12
51.0         17
52.0         14
53.0          8
54.0          2
55.0          7
56.0         12
57.0          5
58.0         11
59.0         12
60.0          1
61.0          0

B. How does the type of contact(type of contact)influence the likelihood of purchasing a travel product?

In [ ]:
contact_types=pd.pivot_table(df,values='ProdTaken' , index="TypeofContact" , aggfunc=np.sum)

In [37]:
contact_types

                 ProdTaken
TypeofContact
Company Invited        310
Self Enquiry           607

C. Is there a correlation between the city tier(citytier)and monthly income (monthly income) of customers?

In [39]:
correlation = pd.pivot_table(df,values='MonthlyIncome' , index="CityTier" , aggfunc=np.sum)

In [40]:
correlation

          MonthlyIncome
CityTier
1            70839753.0
2             4564447.0
3            34546218.0

D. What is the average duration of a pitch (duration of pitch)for customers who purchased a product versus those who did not?

In [51]:
durationavg= pd.pivot_table(df,values="DurationOfPitch" ,index="ProdTaken" , aggfunc='mean')

In [52]:
durationavg

           DurationOfPitch
ProdTaken
0                15.169325
1                16.873143

E. How do occupation types(occupation)distribute among customers,and is there an occupation type that is more likely to purchase a travel product?

In [54]:
occupationdist = df.groupby("Occupation")['CustomerID'].count()

In [55]:
occupationdist

Occupation
Free Lancer          2
Large Business     434
Salaried          2368
Small Business    2084
Name: CustomerID, dtype: int64

In [56]:
occupationtopurchasetp= df.groupby("Occupation")["ProdTaken"].mean()

In [57]:
occupationtopurchasetp

Occupation
Free Lancer       1.000000
Large Business    0.276498
Salaried          0.174831
Small Business    0.184261
Name: ProdTaken, dtype: float64

F. Are there any gender-based preferences for the type of product pitched (ProductPitched)?

In [58]:
gender = pd.pivot_table(df,values="ProductPitched", index="Gender" , aggfunc="count")

In [59]:
gender

         ProductPitched
Gender
Fe Male             155
Female             1817
Male               2916

G. What is the relationship between the number of trips(number of trips)taken by a customer and their likelihood to purchase a new travel product?

In [60]:
tripswithprodtaken = pd.pivot_table(df,values='ProdTaken',index='NumberOfTrips',aggfunc=np.sum)

In [61]:
tripswithprodtaken

               ProdTaken
NumberOfTrips
1.0                  112
2.0                  299
3.0                  217
4.0                   61
5.0                   62
6.0                   64
7.0                   62
8.0                   29
19.0                   1
20.0                   1
21.0                   0
22.0                   0

H.Does having a passport(passport)correlate with a higher number of trips taken or a higher likelihood of purchasing a travel product?

In [62]:
passport = df.groupby('Passport')['NumberOfTrips'].mean()

In [63]:
passport

Passport
0    3.221165
1    3.273844
Name: NumberOfTrips, dtype: float64

In [64]:
likelihood =df.groupby('Passport')['ProdTaken'].mean()

In [65]:
likelihood

Passport
0    0.122908
1    0.347398
Name: ProdTaken, dtype: float64

I.How satisfied are customers with the pitch (pitch satisfaction score),and does this satisfaction influence product purchase?

In [66]:
satisfaction = df.groupby('PitchSatisfactionScore')['CustomerID'].count()

In [67]:
satisfaction

PitchSatisfactionScore
1     942
2     586
3    1478
4     912
5     970
Name: CustomerID, dtype: int64

In [68]:
checkingsatisfaction = df.groupby("PitchSatisfactionScore")["ProdTaken"].sum()

In [69]:
checkingsatisfaction

PitchSatisfactionScore
1    144
2     88
3    316
4    162
5    210
Name: ProdTaken, dtype: int64

J.Among customers with children (number of children visiting), how does the number of children impact travel product purchases?

In [70]:
NumberOfChildrenVisiting = df.groupby('NumberOfChildrenVisiting')['ProdTaken'].mean()

In [71]:
NumberOfChildrenVisiting

NumberOfChildrenVisiting
0.0    0.186691
1.0    0.188462
2.0    0.189513
3.0    0.203077
Name: ProdTaken, dtype: float64

K.Gender preferences for product types: how does gender influence the preference for different types of travel products pitched (product pitched)?

In [72]:
Genderpreferences = pd.pivot_table(df, index='Gender', columns='ProductPitched',aggfunc='size', fill_value=0)

In [73]:
Genderpreferences

ProductPitched  Basic  Deluxe  King  Standard  Super Deluxe
Gender
Fe Male             4      83     0        63             5
Female            676     641    82       263           155
Male             1162    1008   148       416           182

L.Impact of marital status on travel preferences: does marital status affect the choice of travel product, and if so, how do different marital statuses correlate with product purchases (prod taken) ?

In [19]:
impactofmaritialstatus = pd.pivot_table(df, index='MaritalStatus', columns='ProductPitched', aggfunc='size', fill_value=0)

In [20]:
impactofmaritialstatus

ProductPitched  Basic  Deluxe  King  Standard  Super Deluxe
MaritalStatus
Divorced          332     336    52       142            88
Married           816     852   126       380           166
Single            511     221    52        50            82
Unmarried         183     323     0       170             6

In [21]:
Maritialstatuscorr = df.groupby('MaritalStatus')['ProdTaken'].mean()

In [22]:
Maritialstatuscorr

MaritalStatus
Divorced     0.130526
Married      0.139316
Single       0.331878
Unmarried    0.243402
Name: ProdTaken, dtype: float64

M.Relationship between number of children and travel product interest: how does the number of children visiting (number of children visiting) impact the likelihood of purchasing a travel product?

In [23]:
NumberOfChildrenVisiting =  df.groupby('NumberOfChildrenVisiting')['ProdTaken'].mean()

In [24]:
NumberOfChildrenVisiting

NumberOfChildrenVisiting
0.0    0.186691
1.0    0.188462
2.0    0.189513
3.0    0.203077
Name: ProdTaken, dtype: float64

N.Influence of owning a car on travel decisions: is there a correlation between owning a car (own car) and the number of trips taken (number of trips) or the type of travel product purchased?

In [26]:
corrownbycartrips = df.groupby('OwnCar')['NumberOfTrips'].mean()

In [27]:
corrownbycartrips

OwnCar
0    3.264349
1    3.219346
Name: NumberOfTrips, dtype: float64

In [29]:
owncarpur = df.groupby('OwnCar')['ProdTaken'].mean()
owncarpur

OwnCar
0    0.193966
1    0.184697
Name: ProdTaken, dtype: float64

O.Income level and product choice: how does the monthly income (monthly income) of customers influence their choice of travel products, and is there a preferred product for different income levels?

In [30]:
income = pd.pivot_table(df, index='MonthlyIncome', columns='ProductPitched', aggfunc='size', fill_value=0)

In [31]:
income

ProductPitched  Basic  Deluxe  King  Standard  Super Deluxe
MonthlyIncome
1000.0              0       1     0         0             0
4678.0              0       1     0         0             0
16009.0             2       0     0         0             0
16051.0             2       0     0         0             0
16052.0             2       0     0         0             0
...               ...     ...   ...       ...           ...
38621.0             0       0     2         0             0
38651.0             0       0     2         0             0
38677.0             0       0     2         0             0
95000.0             1       0     0         0             0
98678.0             1       0     0         0             0

[2475 rows x 5 columns]